// 1. ავწყობი ხელსაწყო (Build tool)
// Build tool არის პროგრამა, რომელიც ამზადებს ჩვენს კოდს წარმოებისთვის.
// მოკლედ: Build tool ამარტივებს და ავტომატიზირებს Frontend/Backend პროექტის აწყობის პროცესს.


// 2. Vite
// Vite არის თანამედროვე Build tool და Dev Server,
// რომელიც ძალიან სწრაფად ამუშავებს პროექტს,
// Development რეჟიმში კოდი პრაქტიკულად დაუყოვნებლივ იტვირთება,
// ამიტომ Vite არის React, Vue, Svelte, Vanilla JS პროექტების სწრაფი სტარტის საუკეთესო არჩევანი.


// 3. Babel
// Babel არის JavaScript კომპილატორი, რომელიც გვაძლევს საშუალებას
// ახალი, თანამედროვე JavaScript სინტაქსი დავწეროთ,
// ხოლო იგი გარდაქმნის მას ძველ, უკეთ მხარდაჭერილ ვერსიად,
// რათა ის იმუშაოს ყველა ბრაუზერში.


// 4. ESLint
// ESLint არის ინსტრუმენტი, რომელიც ამოწმებს JavaScript კოდს შეცდომებზე,
// სტილის პრობლემებზე და შესაძლო ბაგებზე.
// ის გვაძლევს საშუალებას დავიცვათ ერთიანი კოდის სტანდარტი.


// 5. Node.js
// Node.js არის JavaScript-ის გამშვები გარემო,
// რომელიც გვაძლევს საშუალებას JavaScript კოდი გაუშვათ არა ბრაუზერში,
// არამედ სერვერზე ან კომპიუტერზე.


// 6. CLI (Command Line Interface)
// CLI არის პროგრამული ინტერფეისი, რომელიც მუშაობს ტექსტური ბრძანებების გამოყენებით.
// მაგალითად: "npm install", "git init", "npx create-react-app".


// 7. NVM (Node Version Manager)
// NVM არის ხელსაწყო, რომელიც საშუალებას გაძლევთ მარტივად დააყენოთ,
// გადართოთ და მართოთ Node.js-ის სხვადასხვა ვერსიები ერთსა და იმავე კომპიუტერზე.
// ეს განსაკუთრებით საჭიროა დეველოპერებისთვის,
// რადგან სხვადასხვა პროექტებს შეიძლება სჭირდებოდეთ Node-ის სხვადასხვა ვერსია.