// რა არის კაუჭი (Hook)
// კაუჭი React-ში არის სპეციალური ფუნქცია,
// რომელიც გვაძლევს საშუალებას ფუნქციურ კომპონენტებში
// გამოვიყენოთ ისეთი შესაძლებლობები, როგორიცაა state (მდგომარეობა)

// რატომ შექმნეს კაუჭები
// კაუჭები შექმნეს იმისთვის, რომ:
// - კოდი გამხდარიყო უფრო მარტივი და წასაკითხი
// - აღარ დაგვჭირდეს class კომპონენტების გამოყენება
// - ლოგიკის ხელახლა გამოყენება უფრო ადვილი იყოს
// - კომპონენტები იყოს პატარა, სუფთა და გასაგები

// როდის ვიყენებთ კაუჭებს
// კაუჭებს ვიყენებთ მაშინ, როცა:
// - გვინდა ფუნქციურ კომპონენტში state-ის გამოყენება
// - გვინდა რეაგირება მოვახდინოთ მოვლენებზე (მაგ: მონაცემის შეცვლა)

// რა არის useState კაუჭი
// useState არის React-ის კაუჭი,
// რომელიც გვაძლევს საშუალებას შევინახოთ და შევცვალოთ მონაცემი
// ფუნქციურ კომპონენტში.

// როგორ ვიყენებთ useState კაუჭს
// useState იღებს საწყის მნიშვნელობას
// და აბრუნებს ორ ელემენტს:
// 1) ცვლადს (state)
// 2) ფუნქციას, რომელიც ამ ცვლადს ცვლის